building.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Building A Program</title>
<meta name="author" content="(Bill Carlson)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1>Building A Program</h1>
</section>

</section>
</section>
<section>
<section id="slide-org84b92a4">
<h3 id="org84b92a4">About Me</h3>
<div class="outline-text-3" id="text-org84b92a4">
</div>
</section>
<section id="slide-org04a6cfa">
<h4 id="org04a6cfa">Bill Carlson</h4>
</section>
<section id="slide-org34462d3">
<h4 id="org34462d3">Cotiviti Labs</h4>
</section>
<section id="slide-org020a6dc">
<h4 id="org020a6dc"><a href="https://www.facebook.com/BungalowJax/">The Bungalow</a></h4>

</section>
</section>
<section>
<section id="slide-orgb4f38b3">
<h3 id="orgb4f38b3">Last Time in "Functional Programming"</h3>
<ul class="fragment">
<li>Programming with functions</li>

</ul>
<ul class="fragment">
<li>Referential transparency</li>

</ul>

</section>
<section >

<p>
A program is <i>evaluated</i> by repeated substitution of function calls with the values they represent. 
</p>

</section>
<section >

<p>
The code is simply an interpreter for a particular algebra.  The program is the data that gets evaluated. 
</p>

</section>
<section >

<p>
But how do you actually <i>build</i> the program? 
</p>

</section>
</section>
<section>
<section id="slide-org95e9e08">
<h2 id="org95e9e08">Data Types Revisited</h2>
<p>
Standard Types
</p>
<ul>
<li><code>Int</code></li>
<li><code>String</code></li>

</ul>

<p>
Higher-Kinded Types
</p>
<ul>
<li><code>Option[A]</code></li>
<li><code>List[A]</code></li>
<li><code>Either[E, A]</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd719936">
<h2 id="orgd719936">Typeclasses</h2>
<div class="outline-text-2" id="text-orgd719936">
</div>
</section>
<section id="slide-org1a827ce">
<h4 id="org1a827ce">Typeclasses</h4>
<ul>
<li>Typeclasses are a mechanism to allow for <b>ad-hoc polymorphism</b></li>
<li>The typeclass declares an interface</li>
<li>THe instance defines the operations</li>

</ul>

</section>
<section id="slide-org0002653">
<h4 id="org0002653">Typeclasses allow you to modify behavior of code you don't own.</h4>

</section>
<section id="slide-org613ceac">
<h4 id="org613ceac">Typeclasses</h4>
<div class="org-src-container">

<pre><code class="scala" >trait Show[A] { 
  def show(a: A): String
}
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >implicit val stringShow = new Show[String] {
  def show(s: String) = s
}
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >implicit val addressShow = new Show[Address] {
  def show(addr: Address) = 
    s"""|${addr.street}
        |${addr.city} ${addr.state} ${addr.zip}""".stripMargin
}
</code></pre>
</div>

</section>
<section id="slide-org3f31eb0">
<h4 id="org3f31eb0">Typeclasses</h4>
<div class="org-src-container">

<pre><code class="scala" >// A polymorphic function that works only when there is an implicit 
// instance of Show[A] available
def log[A](a: A)(implicit s: Show[A]) = println(s.show(a))
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >object Show { 
  def apply[A] = implicitly[Show[A]]
}
def log[A : Show](a: A) = println(Show[A].show(a))
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orga417467">
<h2 id="orga417467">Algebraic Combinators</h2>
<div class="outline-text-2" id="text-orga417467">
</div>
</section>
</section>
<section>
<section id="slide-org5124a84">
<h3 id="org5124a84">Monoid</h3>
<div class="org-src-container">

<pre><code class="scala" >trait Monoid[A] { 
  val zero: A
  def append(a: A, b: A)): A
}
</code></pre>
</div>

</section>
<section id="slide-org9aca7f7">
<h4 id="org9aca7f7">String concatenation</h4>
<div class="org-src-container">

<pre><code class="scala" >val stringConcat = new Monoid[String] { 
  val zero: String = ""
  def append(a: String, b: String)) = a + b
}
</code></pre>
</div>

</section>
<section id="slide-org31836d6">
<h4 id="org31836d6">Integer Addition</h4>
<div class="org-src-container">

<pre><code class="scala" >val additionMonoid = new Monoid[Int] { 
  val zero: Int = 0
  def append(a: Int, b: Int)) = a + b
}
</code></pre>
</div>

</section>
<section id="slide-orgd82ca65">
<h4 id="orgd82ca65">Integer Multiplication</h4>
<div class="org-src-container">

<pre><code class="scala" >val multiplicationMonoid = new Monoid[Int] { 
  val zero: Int = 1
  def append(a: Int, b: Int)) = a * b
}
</code></pre>
</div>

</section>
<section id="slide-orgda56d4d">
<h4 id="orgda56d4d">Option</h4>
<div class="org-src-container">

<pre><code class="scala" >def optionMonoid[A : Monoid] = new Monoid[Option[A]] { 
  val zero: Int = None
  def append(a: Option[A], b: Option[A])) = a match { 
    case None => b
    case Some(x) => b match { 
      case None => a
      case Some(y) => Some(implicitly[Monoid[A]].append(x, y))
    }
  }
}

optionMonoid[Int].append(Some(3), Some(4)) == Some(7)
optionMonoid[Int].append(Some(3), None) == Some(3)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orga8b87df">
<h3 id="orga8b87df">Foldable</h3>
<div class="org-src-container">

<pre><code class="scala" >trait Foldable[F[_]] {
  def fodlLeft[A, B](a: F[A])(z: B)(f: (B, A) => B): B
  def foldRight[A, B](a: F[A])(z: B)(f: (A, B) => B): B
  def foldMap[A, B : Monoid](a: F[A])(f: A => B): B = 
    foldLeft(a)(Monoid[B].empty)((b, a) => Monoid[B].append(b, f(b)))
}
</code></pre>
</div>

</section>
<section id="slide-org1890965">
<h4 id="org1890965">Combine</h4>
<div class="org-src-container">

<pre><code class="scala" >def combine[F[_], A : Monoid](a: F[A]): A = 
  Foldable[F].foldMap(a)(identity)

combine(List(1, 2, 3, 4)) // 10
combine(List("how", "now", "brown", "cow")  // "hownowbrowncow"
</code></pre>
</div>

</section>
<section id="slide-org615c7bb">
<h4 id="org615c7bb">Count</h4>
<div class="org-src-container">

<pre><code class="scala" >def count[F[_], A : Monoid](a: F[A]): A = 
  Foldable[F].foldMap(a)(_ => 1)

count(Some(4)) // 1
count(None)    // 0
count(List(1,2,3,4)) // 4
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-org0e92042">
<h3 id="org0e92042">Functor</h3>
<div class="org-src-container">

<pre><code class="scala" >trait Functor[F[_]] { 
  def map[A, B](a: F[A], f: A => B): F[B]
}
</code></pre>
</div>

</section>
<section id="slide-org06b6f4e">
<h4 id="org06b6f4e">Which means?</h4>
<p>
<code>map</code> allows you to modify the values within a context without modifying the shape of the context
</p>

</section>
<section id="slide-org0968d8e">
<h4 id="org0968d8e">What does <i>that</i> mean?</h4>
<div class="org-src-container">

<pre><code class="scala" >Functor[Option].map(Some(4), (_: Int) * 2) === Some(8)
Functor[Option].map(None, (_: Int) * 2) === None
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="scala" >Functor[List].map(List(1, 2, 3, 4), (_: Int) * 2) === List(2, 4, 6, 8)
Functor[List].map(List.empty[Int], (_: Int) * 2) === List()
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org4119c7f">
<h3 id="org4119c7f">Applicative</h3>
<p>
Because not every function has one argument&#x2026; 
</p>

</section>
<section >

<p>
What happens if you have a function 
</p>
<div class="org-src-container">

<pre><code class="scala" >f: (A, B) => C
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >Functor[Option].map(Some(3), f)
// error: type mismatch;
//  found   : (Int, Int) => Int
//  required: Int => ?
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="scala" >f.curried // (a: Int) => (b: Int) => f(a, b)
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >Functor[Option].map(Some(3), f.curried)
// Some[Int => Int]
</code></pre>
</div>

</section>
<section id="slide-org5b31c38">
<h4 id="org5b31c38">Applicative</h4>
<div class="org-src-container">

<pre><code class="scala" >trait Applicative[F[_]] { 
  def ap[A, B](a: F[A], b: F[A => B]): F[B]
}
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >val sum: (a: Int, b: Int) => a + b
val fOption: Option[Int => Int] = Functor[Option].map(Some(3), sum.curried)

Appicative[Option].ap(Some(4), fOption) === Some(7)
</code></pre>
</div>

</section>
<section id="slide-orga48ac42">
<h4 id="orga48ac42">Extensions</h4>
<div class="org-src-container">

<pre><code class="scala" >trait Applicative[F[_]] extends Functor[F] { 
  def pure[A](a: A): F[A]

  def ap[A, B](a: F[A], b: F[A => B]): F[B]

  def map2[A, B, C](
    a: F[A], 
    b: F[B], 
    c: (A, B) => C): F[C] = 
    ap(b, Fucntor[A].map(a, c.curried))
}
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd130aa6">
<h3 id="orgd130aa6">Monad</h3>
<div class="outline-text-3" id="text-orgd130aa6">
</div>
</section>
<section id="slide-orgd17ef83">
<h4 id="orgd17ef83">Monad</h4>
<p>
It's really not that scary
</p>

</section>
<section id="slide-org47887a2">
<h4 id="org47887a2">Monad</h4>
<pre  class="example">
trait Monad[F[_]] extends Applicative[F] {
  def flatMap[A, B](a: F[A])(f: A =&gt; F[B]): F[B]
}
</pre>

</section>
<section id="slide-org7246cba">
<h4 id="org7246cba">Why?</h4>
<pre  class="example">
def getUser(id: String): Option[User]
def getAddress(user: User): Option[Address]

def getAddressForId(id: Sting) = 
  getUser(id).flatMap { user =&gt; 
    getAddress(user)
  }

</pre>

<p class="fragment">
This gets ugly really fast. 
</p>

</section>
<section id="slide-orgec2ca36">
<h4 id="orgec2ca36">for-comprehension</h4>
<ul>
<li>Syntactic sugar built into the Scala compiler.</li>
<li>Similar construct (do-notation) exists in Haskell</li>

</ul>
<pre  class="example">
def getPOBoxForId(id: String) = for { 
  user    &lt;- getUser(id)
  address &lt;- getAddress(user)
  pobox   &lt;- getPOBox(address)
} yield address
</pre>

</section>
<section id="slide-orgee06d1d">
<h4 id="orgee06d1d">Examples</h4>
<pre  class="example">
implicit val optionMonad = new Monad[Option] { 
  def flatMap[A, B](a: Option[A])(f: A =&gt; Option[B]) = a match { 
    case None =&gt; None
    case Some(x) =&gt; f(x)
  }
}
</pre>

</section>
</section>
<section>
<section id="slide-org8465356">
<h3 id="org8465356">Additional Resources</h3>
<ul>
<li><a href="https://wiki.haskell.org/Typeclassopedia">Typeclassopedia</a></li>
<li><a href="https://www.manning.com/books/functional-programming-in-scala">Functional Programming in Scala</a></li>
<li><a href="http://learnyouahaskell.com/">Learn You A Haskell For Great Good</a></li>
<li><a href="http://eed3si9n.com/learning-scalaz/index.html">Learning Scalaz</a>/<a href="http://eed3si9n.com/herding-cats/">Herding Cats</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org41f7463">
<h2 id="org41f7463">?</h2>
<div class="outline-text-2" id="text-org41f7463">
</div>
</section>
</section>
<section>
<section id="slide-org8054a29">
<h3 id="org8054a29">Thank You!</h3>
<ul>
<li>Bill Carlson</li>
<li><a href="https://twitter.com/coacoas">@coacoas</a></li>

</ul>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
